export default [
  {
    version: '0.0.6',
    date: '2019-04-08',
    desc: [
      '✨数据优化~提升至少一倍的加载速度~',
      '✨首页新增搜索功能'
    ]
  },
  {
    version: '0.0.5',
    date: '2019-04-02',
    desc: [
      '✨游戏更新记更换抓取源，去除大图片加载，还能和官网同步数据~',
      '✨式神详情页面->御魂推荐更换 UI ~，更加契合本地 UI'
    ]
  },
  {
    version: '0.0.4',
    date: '2019-03-26',
    desc: [
      '✨新增御魂信息查询~稍后版本会增加御魂模拟器',
      '✨新增式神御魂推荐',
      '✨新增式神技能耗火和类型',
      '✨新增式神详情，星级、等级小提示~',
      '✨新增活动提醒~',
      '✨修复查询逢魔和悬赏时，搜索结果会闪烁问题',
      '✨修复小程序版本更新日志每条排序错乱问题（估计没人看到吧~）',
      '✨优化式神传记，不会一次性显示出来占用过多篇幅'
    ]
  },
  {
    version: '0.0.3',
    date: '2019-03-17',
    desc: [
      '✨重构了小程序，此次版本没有添加新内容',
      '✨修复了N卡加载失败问题',
      '✨优化了页面加载机制，再也不用等半天才看到啦~'
    ]
  },
  {
    version: '0.0.2',
    date: '2019-03-08',
    desc: [
      '✨悬赏封印支持首字母快捷搜索，现在会自动联想，可以更快看到想要的数据呢',
      '✨新增逢魔密信查询，并且支持拼音快捷搜索',
      '✨式神详情新增觉醒材料、皮肤鉴赏、等级星级等数据查询',
      '✨新增游戏更新日志，再也不要到处找更新内容啦',
      '✨重新设计式神详情技能模块',
      '✨首页式神切换支持左右滑动，再也不怕点不到啦',
      '✨加入过场加载动画，防止数据一堆一堆的加载影响视觉',
      '✨更多变化等你来探索~'
    ]
  },
  {
    version: '0.0.1',
    date: '2019-03-01',
    desc: [
      '✨阴阳师的痒痒鼠小程序上线啦！',
      '✨新增悬赏封印快速查询',
      '✨新增式神详情快速查询'
    ]
  }
];
